<template>
    <v-row dense class="px-3">
        <v-col>
            <v-alert
                    border="left"
                    color="blue-grey"
                    dark
                    icon="mdi-numeric-3-box"
                    dense
            >Содержание поста

                <v-tooltip bottom>
                    <template v-slot:activator="{ on }">
                        <v-spacer></v-spacer> <v-btn x-small color="primary" dark v-on="on">Подсказка</v-btn>
                    </template>
                    <span>Подсказка</span>
                </v-tooltip>
            </v-alert>

                <v-textarea
                        v-model="text"
                        solo
                        background-color="blue lighten-5"
                        name="input-7-4"
                        label="Напишите текст поста, который появится в Вашей группе при публикации игры."
                        value="text"
                        auto-grow

                        hint="
                            {ссылка} — подставится ссылка на архив,
                            {min} — левая граница,
                            {max} — правая граница"
                ></v-textarea>
            </v-col>


    </v-row>
</template>

<script>
    export default {
        data() {
            return {
                min: "10",
                text: '',
                text1: "У нас конкурс 🎁\n" +
                    "            \n" +
                    "Мы загадали число от {min} до {max}. Угадавший получит приз.\n" +
                    "\n" +
                    "Правила конкурса: вам нужно угадать число, которое мы загадали. Для этого в комментариях под этим постом напишите ваш вариант. Например, !15.\n" +
                    "\n" +
                    "Наш бот в ответном сообщении сообщит вам угадали вы или нет.\n" +
                    "\n" +
                    "Каждый участник имеет 3 попытки с минимальным интервалом в 1 минуту.\n" +
                    "\n" +
                    "Чтобы участвовать вступите в нашу группу и сделайте репост этой записи.\n" +
                    "\n" +
                    "Проверить бота на честность: {ссылка}"

        }
        }
    }
</script>

<style scoped>

</style>