<template>
    <div class="col-lg-12">
        <h6 class="p-2 mb-2 bg-primary text-white">3. Настройки поста</h6>
        <b-form-textarea
                name="textOfThePost"
                id="textarea"
                v-model="text"
                placeholder="Напишите текст поста с игрой."
                rows="3"
                value="text"
                max-rows="18"
        ></b-form-textarea>
    </div>
</template>

<script>
    export default {
        data() {
            return {
                text: 'У нас конкурс 🎁\n' +
                    '            \n' +
                    'Мы загадали число от {min} до {max}. Угадавший получит приз.\n' +
                    '\n' +
                    'Правила конкурса: вам нужно угадать число, которое мы загадали. Для этого в комментариях под этим постом напишите ваш вариант. Например, !15.\n' +
                    '\n' +
                    'Наш бот в ответном сообщении сообщит вам угадали вы или нет.\n' +
                    '\n' +
                    'Каждый участник имеет 3 попытки с минимальным интервалом в 1 минуту.\n' +
                    '\n' +
                    'Чтобы участвовать вступите в нашу группу и сделайте репост этой записи.\n' +
                    '\n' +
                    'Проверить бота на честность: {ссылка}\n' +
                    '\n' +
                    'Конкурс сделан с помощью сервиса Пьедестал.'
            }
        }
    }
</script>

<style scoped>

</style>